---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FilterRule Properties
FilterRule Class See Also Send Feedback
---

The FilterRule type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FilterRule Class

Autodesk.Revit.DB Namespace